import React from "react";
import { FaCheck } from "react-icons/fa";

const Feature = () => {
  return (
    <div>
      <p className="text-[16px] font-bold text-[#1E1E1E]">
        درباره فروشگاه محسن
      </p>

      <p className="text-[14px] font-regular text-[#1E1E1E] leading-[30px] mt-2">
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
        درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
        نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
        خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید
        داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
        متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
        گرافیک است.
      </p>
      <p className="text-[14px] font-regular text-[#1E1E1E] leading-[30px]">
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
        درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
        نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
        خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید
        داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
        متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
        گرافیک است.
      </p>

      <p className="text-[16px] font-bold text-[#1E1E1E] my-5">
        امکانات و ویژگی‌ها
      </p>
      <div className="flex items-center justify-left gap-1 mt-3 flex-wrap">
        <div className="bg-[#1F5D6A] rounded-full p-1">
          <FaCheck color="white" size={12} />
        </div>
        <p className="text-[14px] font-medium text-[#1E1E1E]">
          تنوع بالا در محصولات:
        </p>
        <p className="text-[14px] font-regular text-[#1E1E1E]">
          از لباس‌های روزمره تا استایل رسمی و مجلسی، مناسب همه سلیقه‌ها
        </p>
      </div>
      <div className="flex items-center justify-left gap-1 mt-3 flex-wrap">
        <div className="bg-[#1F5D6A] rounded-full p-1">
          <FaCheck color="white" size={12} />
        </div>
        <p className="text-[14px] font-medium text-[#1E1E1E]">
          پشتیبانی اختصاصی:
        </p>
        <p className="text-[14px] font-regular text-[#1E1E1E]">
          پاسخگویی سریع و کامل به سوالات شما از طریق چت و تماس
        </p>
      </div>
      <div className="flex items-center justify-left gap-1 mt-3 flex-wrap">
        <div className="bg-[#1F5D6A] rounded-full p-1">
          <FaCheck color="white" size={12} />
        </div>
        <p className="text-[14px] font-medium text-[#1E1E1E]">
          تخفیف‌های ویژه و دوره‌ای:
        </p>
        <p className="text-[14px] font-regular text-[#1E1E1E]">
          عضویت در باشگاه مشتریان و بهره‌مندی از کدهای تخفیف
        </p>
      </div>
    </div>
  );
};

export default Feature;
